In [12]:
import pandas as pd

df = pd.read_excel("score.xlsx")
df

  지원번호   이름   학교    키   국어   영어   수학  사회        SW특기
0   1번  강나래  구로고  197   90   85  100  85      Python
1   2번  강태원  구로고  184   40   35   50  25        Java
2   3번  강호림  가산고  168   80   75   70  75  Javascript
3   4번  김수찬  구로고  187   40   60   70  80         NaN
4   5번  김재욱  가산고  188   15   20   10  10         NaN
5   6번  박동현  가산고  202   80  100   95  80           C
6   7번  박혜정  구로고  188   55   65   45  35      PYTHON
7   8번  승근열  구로고  190  100   85   90  95          C#

In [ ]:
df['수학'][2:6]
# 거꾸로 쓰기 : df[2:6]['수학']

2    70
3    70
4    10
5    95
Name: 수학, dtype: int64

In [8]:
df[['이름','수학']][2:6]

    이름  수학
2  강호림  70
3  김수찬  70
4  김재욱  10
5  박동현  95

In [11]:
df[2:6]['수학']

2    70
3    70
4    10
5    95
Name: 수학, dtype: int64